Repository: black3r/testovac-front-end
Catalog: testovac/locale/*/LC_MESSAGES/django.po
Languages: sk

source: Tester-site administration
sk: Administrácia stránky testovača

source: Signed in as
sk: Prihlásené ako

source: Log out
sk: Odhlásiť

source: Username
sk: Meno

source: Password
sk: Heslo

source: Log in
sk: Prihlásiť

source: Don't have account yet?
sk: Ešte nemáš účet?

source: Register
sk: Zaregistruj sa

source: Registration
sk: Registrácia

source: Thanks for registering. You are now logged in.
sk: Vďaka za registráciu.

source: News
sk: Novinky

source: Tasks
sk: Úlohy

source: Results
sk: Výsledky

source: custom results table
sk: špeciálna výsledkovka

source: custom results tables
sk: špeciálne výsledkovky

source: Results for
sk: Výsledky pre

source: name
sk: meno

source: login name
sk: login

source: sum
sk: spolu

source: Hide staff
sk: Skryť vedúcich

source: Show staff
sk: Zobraz vedúcich

source: Create new results table
sk: Vytvor novú výsledkovku

source: Contests' results
sk: Výsledky contestov

source: Contest and its results are hidden
sk: Contest a jeho výsledkovka sú skryté

source: Results will become visible to contestants at the start of the contest
sk: Súťažiaci uvidia výsledky až po začiatku contestu

source: Resubmit successful.
sk: Úspešne znovu-odovzdané.

source: Resubmit not successful. Judge unavailable.
sk: Resubmit sa nepodaril. Testovač nie je dostupný.

source: Failed submits
sk: Nepodarené submity

source: Everything OK
sk: Všetko v poriadku

source: Deduce from extension
sk: Zisti podľa prípony

source: Wrong answer
sk: Zlá odpoveď

source: Time limit exceeded
sk: Prekročený časový limit

source: Runtime exception
sk: Chyba počas behu programu

source: Security exception
sk: Pokus o narušenie bezpečnosti

source: Ignored
sk: Ignorované

source: Compilation error
sk: Chyba počas kompilácie

source: Sending to judge
sk: Odosielam na testovač

source: Sent to judge
sk: Odoslané na testovač

source: Judge unavailable
sk: Testovač je nedostupný

source: Protocol corrupted
sk: Protokol je nečitateľný

source: Reviewed
sk: Ohodnotené

source: Language
sk: Jazyk

source: Invalid file extension %(extension)s
sk: Typ súboru %(extension)s nie je podporovaný

source: No file was submitted
sk: Nebol odovzdaný žiadny súbor

source: Automatic language discovery failed. Unknown language extension.
sk: Automatické určenie jazyka zlyhalo kvôli neznámej/nepodporovanej koncovke.

source: no
sk: nie

source: with penalization
sk: s penalizáciou

source: yes
sk: áno

source: Submit solution
sk: Odovzdaj riešenie

source: You can't submit solutions for this task.
sk: Pre túto úlohu nemôžete odovzdávať riešenia.

source: Use a special page to submit.
sk: Na odovzdávanie slúži samostatná stránka.

source: Page with external submit
sk: Stránka s odovzdávaním

source: Time
sk: Čas

source: State
sk: Stav

source: Score
sk: Body

source: Actions
sk: Akcie

source: Not reviewed
sk: Neohodnotené

source: Not accepted
sk: Neakceptované

source: Accepted with penalization
sk: Akceptované s penalizáciou

source: View
sk: Detaily

source: Protocol is not available.
sk: Protokol nie je dostupný.

source: Compiler output
sk: Výstup z kompilátora

source: Test case
sk: Vstup

source: Result
sk: Výsledok

source: Run time
sk: Čas behu

source: Show details
sk: Zobraz detaily

source: Review
sk: Hodnotenie

source: Reviewed file
sk: Opravneé riešenie

source: Reviewer's comment
sk: Komentár opravovateľa

source: Not reviewed yet.
sk: Zatiaľ neohodnotené.

source: User
sk: Používateľ

source: Accepted
sk: Akceptované

source: Submitted file
sk: Odovzdaný súbor

source: Show
sk: Ukáž

source: Download
sk: Stiahni

source: Submit details
sk: Detaily submitu

source: Edit and review
sk: Uprav a ohodnoť

source: Rejudge submit
sk: Pretestovať submit

source: Protocol
sk: Protokol

source: All submits
sk: Všetky submity

source: Submit successful. Testing protocol will be soon available <a href="{link}">here</a>.
sk: Úspešne odovzdané. Protokol z testovania bude čoskoro dostupný <a href="{link}">tu</a>.

source: Submit successful.
sk: Úspešne odovzdané.

source: Upload to judge was not successful.
sk: Pri odosielaní na testovač nastala chyba.

source: Contest has already finished, this submit won't affect the results.
sk: Súťaž sa už skončila, tento submit sa nezapočíta do výsledkovky.

source: official contestants' group
sk: oficiálna skupina súťažiacich

source: all staff
sk: všetci vedúci

source: administrators' group
sk: skupina administrátorov

source: contest
sk: súťažné kolo

source: contests
sk: súťažné kolá

source: task
sk: úloha

source: tasks
sk: úlohy

source: competition
sk: súťaž

source: competitions
sk: súťaže

source: Create new contest
sk: Vytvor nový contest

source: Runnig now
sk: Práve prebieha

source: New contest
sk: Nový contest

source: Since
sk: Od

source: Until
sk: Do

source: Contest is hidden
sk: Contest je skrytý

source: Tasks will become visible to contestants at the start of the contest
sk: Súťažiaci uvidia úlohy až po začiatku contestu

source: Edit contest
sk: Uprav contest

source: View all submits of all users
sk: Zobraz submity všetkých používateľov

source: Download task statement
sk: Stiahni zadanie

source: Task statement is not available to download.
sk: Zadanie sa nedá stiahnuť.

source: Admins only
sk: Iba administrátori

source: Edit
sk: Upraviť

source: Rejudge last submits
sk: Pretestovať posledné submity

source: Solution
sk: Riešenie

source: Solutions for this task can't be submitted yet.
sk: K tejto úlohe sa zatiaľ nedajú odovzdávať riešenia.

source: You must log in to submit a solution.
sk: Na odovzdanie riešenia sa musíš prihlásiť.

source: There are no news yet
sk: Zatiaľ nemáme žiadne novinky

source: locked
sk: zamknuté
